In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book8.csv')
df

       Genre  year  budget  rating
0     Action  2008      28      48
1     Action  2009     200      63
2     Action  2008      32      57
3     Action  2010      20      52
4  Adventure  2009      18      84
5  Adventure  2010     105      44
6     Comedy  2010      20      70
7     Comedy  2008       8      81
8     Comedy  2009      30      71

In [5]:
df.pivot_table(index='Genre')

              budget  rating     year
Genre
Action     70.000000    55.0  2008.75
Adventure  61.500000    64.0  2009.50
Comedy     19.333333    74.0  2009.00

In [6]:
df.pivot_table(index='Genre',columns='year')

          budget               rating
year        2008   2009   2010   2008  2009  2010
Genre
Action      30.0  200.0   20.0   52.5  63.0  52.0
Adventure    NaN   18.0  105.0    NaN  84.0  44.0
Comedy       8.0   30.0   20.0   81.0  71.0  70.0

In [7]:
#in above example aggfunc='mean' bydefault

In [8]:
df.pivot_table(index='Genre',columns='year',aggfunc='count')

          budget           rating
year        2008 2009 2010   2008 2009 2010
Genre
Action       2.0  1.0  1.0    2.0  1.0  1.0
Adventure    NaN  1.0  1.0    NaN  1.0  1.0
Comedy       1.0  1.0  1.0    1.0  1.0  1.0

In [9]:
df.pivot_table(index='Genre',columns='year',aggfunc='max')

          budget               rating
year        2008   2009   2010   2008  2009  2010
Genre
Action      32.0  200.0   20.0   57.0  63.0  52.0
Adventure    NaN   18.0  105.0    NaN  84.0  44.0
Comedy       8.0   30.0   20.0   81.0  71.0  70.0

In [10]:
df.pivot_table(index='Genre',columns='year',aggfunc='sum')

          budget               rating
year        2008   2009   2010   2008  2009  2010
Genre
Action      60.0  200.0   20.0  105.0  63.0  52.0
Adventure    NaN   18.0  105.0    NaN  84.0  44.0
Comedy       8.0   30.0   20.0   81.0  71.0  70.0

In [11]:
#fill_value..to replace the missing values

In [12]:
df.pivot_table(index='Genre',columns='year',aggfunc='sum',fill_value='okk')

          budget           rating
year        2008 2009 2010   2008 2009 2010
Genre
Action        60  200   20    105   63   52
Adventure    okk   18  105    okk   84   44
Comedy         8   30   20     81   71   70

In [13]:
#if in our dataframe there is column containg all NaN values then it get automatically removed because in argument dropna=True

In [15]:
df.pivot_table(index='Genre',columns='year',aggfunc='sum',fill_value=0,margins=True)

          budget                rating
year        2008 2009 2010  All   2008 2009 2010  All
Genre
Action        60  200   20  280    105   63   52  220
Adventure      0   18  105  123      0   84   44  128
Comedy         8   30   20   58     81   71   70  222
All           68  248  145  461    186  218  166  570